{"module":{"contents":{"data":{}},"title":"Functions Callbacks","path":"1-Javascript-General-Topics/functions-callbacks","id":"functions-callbacks","body":"<h3 id=\"functions-as-callbacks-\">Functions as &#39;callbacks&#39;</h3>\n<p>Something to always remember is that there is a difference between a function definition and a function being &#39;executed&#39; or &#39;called&#39;.\nThat seems pretty basic, but it can really get confusing when we get into the idea of passing around function definitions. Let&#39;s take a look\nat an example:</p>\n<pre><code class=\"lang-javascript\">let helloWorld = function(name){\n  console.log(`Hello ${name}!`);\n}\n\nconsole.log(helloWorld);\n</code></pre>\n<p>Above, the result of the console log is just going to be the definition of the function, try something like this in your browser console\nwindow if you like, and you&#39;ll see that a function&#39;s definition can be passed around - and in fact this is something you&#39;ve done\nall the time in javascript, and if you&#39;re like me, you had no idea what exactly was happening. Let&#39;s explain with another example</p>\n<pre><code class=\"lang-javascript\">\nfunction hollerBackFunc(callBackFunction){\n  return callBackFunction(10);\n}\n\nconst doubler = (num) =&gt; num * 2;\nconst addFive = (num) =&gt; num + 5;\nconst squarer = (num) =&gt; num * num;\n\nconst result1 = hollerBackFunc(doubler); // 20\nconst result2 = hollerBackFunc(addFive); // 15\nconst result3 = hollerBackFunc(squarer); // 100\n</code></pre>\n<p>What is happening here!? Let&#39;s take it a step at a time. First, let&#39;s note that we have a bunch of functions defined here,\nspecifically <code>hollerBackFunc</code>,<code>doubler</code>, <code>addFive</code> and <code>squarer</code>. The last 3 are more or less self explanatory, but if the arrows are giving you trouble:\n<a href=\"https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions\">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions</a>\nAnd feel free to ask for help if they still give you trouble!</p>\n<p>Let&#39;s take a look at <code>hollerBackFunc</code>. This function looks mostly familiar, but the weirdest thing about it is that\nit seems to be executing one of it&#39;s parameters as though it were a function - well that&#39;s because it is. Functions can expect almost anything\nto get passed into them. That means arrays, numbers, strings, objects and yes - function definitions. Now unlike a function that has\nalready been called and is resolved before being passed in, an &#39;uncalled&#39; function is passed in as is. So in the case of\n<code>hollerBackFunc</code> - the first parameter it can expect is a function. Additionally, this function is then called <strong>inside</strong>\n<code>hollerBackfunc</code>, and 10 is always passed into whatever it gets. The result if <strong>that</strong> is then returned. So let&#39;s take a look at\nthat with <code>doubler</code>.</p>\n<p><code>doubler</code> takes any number passed in, and doubles it, then returns the result - easy peasy. So with the line</p>\n<pre><code class=\"lang-javascript\">const result1 = hollerBackFunc(doubler); //20\n</code></pre>\n<p><code>doubler</code> replaces the parameter <code>callBackFunction</code> inside of <code>hollerBackFunc</code>. So let&#39;s imagine that instead of <code>callBackFunction</code>,\nwe have <code>doubler</code>. It should look something like this in your head:</p>\n<pre><code class=\"lang-javascript\">function hollerBackFunc(/is now doubler*/){\n  return (num =&gt; num * 2)(10);\n}\n</code></pre>\n<p>I cheated a bit and just wrote the definition of doubler inline, wrapped it in parenthesis and passed 10 into it. The reality is,\nthat is more or less what is happening. If you try copying <code>(num =&gt; num * 2)(10)</code> and pasting it in the console, you&#39;ll see it works.</p>\n<p>Now the result of that is 20, and that is returned out to the result of hollerBackFunc! We&#39;ll be approaching this idea\nrepeatedly throughout the course, so don&#39;t be perturbed if it doesn&#39;t immediately click, but still feel free to ask for more info.</p>\n"}}