{"module":{"contents":{"data":{}},"title":"Functions Return","path":"1-Javascript-General-Topics/functions-return","id":"functions-return","body":"<h4 id=\"return\">Return</h4>\n<p>If the conceptual &#39;beginning&#39; of a function interpretation is resolving the values of the parameters, the return statement is the conceptual &#39;end&#39;, or the result of what a function is - this is what the return keyword is used for.</p>\n<p>Before we get into it, let&#39;s talk about how the interpreter deals with functions. When a function is <strong>called</strong>, we know because of the <code>()</code> at the end.\nFor example:</p>\n<pre><code class=\"lang-javascript\">\nconst myThing = function(aNumber) {\n  return aNumber * 10;\n}\n\nmyThing(5);\n</code></pre>\n<p>We can see above that myThing is being called. The interpreter, will then take that <code>5</code> we passed in, and replace the <code>aNumber</code>\nparameter with it. However, it&#39;s not done yet.</p>\n<p>Let&#39;s take a new function as an example:</p>\n<pre><code class=\"lang-javascript\">function someNewFunction() {\n  console.log(&#39;hello world&#39;);\n}\n\nsomeNewFunction(); // console logs &#39;hello world&#39;\n</code></pre>\n<p>Now that function works great, but what happens when we do this?</p>\n<pre><code class=\"lang-javascript\">function someNewFunction() {\n  console.log(&#39;hello world&#39;);\n}\n\nsomeNewFunction(); // console logs &#39;hello world&#39;\n\nlet x = someNewFunction();\n`\n</code></pre>\n<p>What does <code>x</code> resolve to here? And does that console log still fire? Well the answer is that first,\nif no explicit return statement is defined for a function, at the end it, it just returns <code>undefined</code>.\nSecond, it&#39;s important to remember that when you call a function, everything inside -still- gets called,\neven if there is no return statement. So that <code>console.log</code> does fire.</p>\n<p>So let&#39;s get back to our <code>myThing</code> function. Let&#39;s take a look at what it&#39;s returning, <code>return aNumber * 10;</code></p>\n<p>When the interpreter gets here, it first wants to handle the operation it sees. Let&#39;s assume that what we\npassed into this function resolves aNumber as <code>5</code> - this becomes <code>5 * 10</code> which of course is <code>50</code>. So the final statement is\n<code>return 50</code>. I know this seems pedantic or overly specific, but this thought process is foundational.</p>\n<p>So, with this information, we know a bit more about what this function is doing. It&#39;s really simple, it takes a number and it returns\nthat same number times 10. Let&#39;s utilize this information to first better name the function</p>\n<pre><code class=\"lang-javascript\">\n/** as a side note, this is still a pure function, as a pure function is defined by a function that always\nreturns the same value no matter what, as long as the inputs are the same, and has no internal dependencies that may change,\n as well as having no hidden &#39;outputs&#39; - eg, it doesn&#39;t access an external object and mutate its value(s)\n **/\nfunction multiplyNumberByTen(aNumber){\n  return aNumber * 10;\n}\n\nmultiplyNumberByTen(5);\n</code></pre>\n<p>Now the first thing to note is that this is a lot more understandable. Reading just the implementation of the function\nshould give you a clear idea of the purpose. This is just a good practice, and something I&#39;ll be encouraging and noting in your own code.</p>\n<p>Additionally, because our function is returning a value, our <code>numberResult</code> gets set to that returned value, which in this case is <code>50</code>.</p>\n"}}